#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cluster_fargate.data.aws_eks_cluster.eks_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks_cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "playground"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.cluster_fargate.data.aws_eks_cluster_auth.eks_cluster_auth will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "eks_cluster_auth" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.cluster_fargate.aws_eip.main will be created
  + resource "aws_eip" "main" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "playground-eip"
        }
      + tags_all             = {
          + "Name"       = "playground-eip"
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
      + vpc                  = (known after apply)
    }

  # module.cluster_fargate.aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.1-eksbuild.9"
      + arn                         = (known after apply)
      + cluster_name                = "playground"
      + configuration_values        = jsonencode(
            {
              + computeType = "Fargate"
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      + tags_all                    = {
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
    }

  # module.cluster_fargate.aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "playground"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags_all                      = {
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
      + version                       = "1.30"

      + access_config (known after apply)

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.cluster_fargate.aws_eks_fargate_profile.kube_system will be created
  + resource "aws_eks_fargate_profile" "kube_system" {
      + arn                    = (known after apply)
      + cluster_name           = "playground"
      + fargate_profile_name   = "kube-system"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = {
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }

      + selector {
          + namespace = "kube-system"
        }
    }

  # module.cluster_fargate.aws_eks_fargate_profile.namespaces["playground"] will be created
  + resource "aws_eks_fargate_profile" "namespaces" {
      + arn                    = (known after apply)
      + cluster_name           = "playground"
      + fargate_profile_name   = "playground"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = {
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }

      + selector {
          + namespace = "playground"
        }
    }

  # module.cluster_fargate.aws_iam_role.eks will be created
  + resource "aws_iam_role" "eks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "playground-eks"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cluster_fargate.aws_iam_role.eks_fargate_pods will be created
  + resource "aws_iam_role" "eks_fargate_pods" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "playground-eks-fargate-pods"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cluster_fargate.aws_iam_role_policy_attachment.eks_cluster will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "playground-eks"
    }

  # module.cluster_fargate.aws_iam_role_policy_attachment.eks_fargate_pod_execution will be created
  + resource "aws_iam_role_policy_attachment" "eks_fargate_pod_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = "playground-eks-fargate-pods"
    }

  # module.cluster_fargate.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "playground-igw"
        }
      + tags_all = {
          + "Name"       = "playground-igw"
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
      + vpc_id   = (known after apply)
    }

  # module.cluster_fargate.aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "playground-nat"
        }
      + tags_all                           = {
          + "Name"       = "playground-nat"
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
    }

  # module.cluster_fargate.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "playground-private-route-table"
        }
      + tags_all         = {
          + "Name"       = "playground-private-route-table"
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
      + vpc_id           = (known after apply)
    }

  # module.cluster_fargate.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "playground-public-route-table"
        }
      + tags_all         = {
          + "Name"       = "playground-public-route-table"
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
      + vpc_id           = (known after apply)
    }

  # module.cluster_fargate.aws_route_table_association.private["sa-east-1a"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_fargate.aws_route_table_association.private["sa-east-1b"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_fargate.aws_route_table_association.public["sa-east-1a"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_fargate.aws_route_table_association.public["sa-east-1b"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.cluster_fargate.aws_subnet.private["sa-east-1a"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "playground-private-subnet-sa-east-1a"
          + "kubernetes.io/cluster/playground" = "owned"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "playground-private-subnet-sa-east-1a"
          + "kubernetes.io/cluster/playground" = "owned"
          + "kubernetes.io/role/internal-elb"  = "1"
          + "managed-by"                       = "terraform"
          + "owner"                            = "rodrigogurgel"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.cluster_fargate.aws_subnet.private["sa-east-1b"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "playground-private-subnet-sa-east-1b"
          + "kubernetes.io/cluster/playground" = "owned"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "playground-private-subnet-sa-east-1b"
          + "kubernetes.io/cluster/playground" = "owned"
          + "kubernetes.io/role/internal-elb"  = "1"
          + "managed-by"                       = "terraform"
          + "owner"                            = "rodrigogurgel"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.cluster_fargate.aws_subnet.public["sa-east-1a"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "playground-public-subnet-sa-east-1a"
          + "kubernetes.io/cluster/playground" = "owned"
          + "kubernetes.io/role/elb"           = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "playground-public-subnet-sa-east-1a"
          + "kubernetes.io/cluster/playground" = "owned"
          + "kubernetes.io/role/elb"           = "1"
          + "managed-by"                       = "terraform"
          + "owner"                            = "rodrigogurgel"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.cluster_fargate.aws_subnet.public["sa-east-1b"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "sa-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "playground-public-subnet-sa-east-1b"
          + "kubernetes.io/cluster/playground" = "owned"
          + "kubernetes.io/role/elb"           = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "playground-public-subnet-sa-east-1b"
          + "kubernetes.io/cluster/playground" = "owned"
          + "kubernetes.io/role/elb"           = "1"
          + "managed-by"                       = "terraform"
          + "owner"                            = "rodrigogurgel"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.cluster_fargate.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "playground-vpc"
        }
      + tags_all                             = {
          + "Name"       = "playground-vpc"
          + "managed-by" = "terraform"
          + "owner"      = "rodrigogurgel"
        }
    }

  # module.cluster_fargate.helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.8.4"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "metrics.enabled"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
    }

  # module.cluster_fargate.kubernetes_namespace.namespaces["playground"] will be created
  + resource "kubernetes_namespace" "namespaces" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
            }
          + name             = "playground"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @rodrigogurgel, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Pull Request`*